<a href="https://colab.research.google.com/github/bttrung/python-study-notebooks/blob/master/pandas/5_Access_Elements_in_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [6]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35},{'watches': 10, 'bikes': 15, 'pants': 5}]
sc = pd.DataFrame(items, index=['store 1', 'store 2'])
sc

         bikes  pants  watches
store 1     20     30       35
store 2     15      5       10

In [9]:
# access column
sc[['bikes']]

         bikes
store 1     20
store 2     15

In [10]:
# access row using row index
sc.loc[['store 1']]

         bikes  pants  watches
store 1     20     30       35

In [11]:
# access individual element
# the order should be: column label, row label
sc['pants']['store 2']

5

In [12]:
# assignment
sc['pants']['store 2'] = 50
sc

         bikes  pants  watches
store 1     20     30       35
store 2     15     50       10

In [13]:
# assign value to 1 column
sc['bikes'] = [44, 55]
sc

         bikes  pants  watches
store 1     44     30       35
store 2     55     50       10

In [15]:
# assign value to 1 row
sc.loc['store 2'] = 11, 22, 33 
sc

         bikes  pants  watches
store 1     44     30       35
store 2     11     22       33

In [17]:
# add new column
sc['shirts'] = 45, 56
sc

         bikes  pants  watches  shirts
store 1     44     30       35      45
store 2     11     22       33      56

In [18]:
# add new column based on the existing columns
sc['suits'] = sc['shirts'] + sc['pants']
sc

         bikes  pants  watches  shirts  suits
store 1     44     30       35      45     75
store 2     11     22       33      56     78

In [22]:
# add new row
new_item = [{'bikes': 20, 'pants': 3, 'watches': 36, 'glasses': 33}]
new_sc = pd.DataFrame(new_item, index=['store 3'])
sc = sc.append(new_sc)
sc

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     44      NaN     30    45.0   75.0       35
store 2     11      NaN     22    56.0   78.0       33
store 3     20     33.0      3     NaN    NaN       36

In [23]:
# add new watches
sc['new_watches'] = sc['watches'][1:] # get from index 1
sc

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     44      NaN     30    45.0   75.0       35          NaN
store 2     11      NaN     22    56.0   78.0       33         33.0
store 3     20     33.0      3     NaN    NaN       36         36.0

In [24]:
# insert shoes before index 5
sc.insert(5, 'shoes', [1, 2, 3]) 
sc

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     44      NaN     30    45.0   75.0      1       35          NaN
store 2     11      NaN     22    56.0   78.0      2       33         33.0
store 3     20     33.0      3     NaN    NaN      3       36         36.0

In [25]:
# remove column
sc.pop('new_watches')
sc

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     44      NaN     30    45.0   75.0      1       35
store 2     11      NaN     22    56.0   78.0      2       33
store 3     20     33.0      3     NaN    NaN      3       36

In [27]:
# remove row
sc = sc.drop(['store 1'], axis=0)
sc

         bikes  glasses  pants  shirts  suits  shoes  watches
store 2     11      NaN     22    56.0   78.0      2       33
store 3     20     33.0      3     NaN    NaN      3       36

In [28]:
# change column label
sc = sc.rename(columns={'bikes': 'hats'})
sc

         hats  glasses  pants  shirts  suits  shoes  watches
store 2    11      NaN     22    56.0   78.0      2       33
store 3    20     33.0      3     NaN    NaN      3       36

In [30]:
sc = sc.rename(index={'store 3' : 'Singapore store', 'store 2': 'Vietnam store'})
sc

                 hats  glasses  pants  shirts  suits  shoes  watches
Vietnam store      11      NaN     22    56.0   78.0      2       33
Singapore store    20     33.0      3     NaN    NaN      3       36